blog-posts/2005-08-25-planner-tip-what-day-is-it.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Planner tip: What day is it?</title>
<!-- 2014-04-30 Wed 17:35 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Planner tip: What day is it?</h1>
<p>
August 25th, 2005 -
<a href="http://sachachua.com/blog/p/2930"><a href="http://sachachua.com/blog/p/2930">http://sachachua.com/blog/p/2930</a></a>
</p>

<p>
I sometimes forget what day it is, so I changed my planner template to
 something that fills in the day, too.
</p>

<pre class="example">
(defun sacha/planner-day-page-template ()
  "Day page template for Sacha."
  (let ((date (planner-filename-to-calendar-date (planner-page-name))))
    (insert "Headlines for "
            (calendar-day-name date)
            ":\n\n\n\n* Tasks\n\n\n* Notes\n\n")))
(setq planner-day-page-template 'sacha/planner-day-page-template)
</pre>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
